In [2]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
#create a series from dict
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [ ]:
#Series (single column)
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [63]:
#DataFrame (table)
#create a dataframe from a dict of list

data = {
  'Name' : ['Krish','John','Jack'],
  'Age' : [25,30,45],
  'City' : ['Bangalore','Chicago','Kashmir']
  
}
df = pd.DataFrame(data)
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30    Chicago
2   Jack   45    Kashmir

In [ ]:
#Create a dataframe from a list of dictionaries

data = [
  {"Name":"ravi","Age":12,"city":"mumbai"},
  {"Name":"rohan","Age":21,"city":"delhi"},
  {"Name":"raj","Age":45,"city":"chennai"}
  
]
df = pd.DataFrame(data)
df

    Name  Age     city
0   ravi   12   mumbai
1  rohan   21    delhi
2    raj   45  chennai

In [62]:
df = pd.read_csv('sales_data.csv')
# df.head()
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [65]:
data = [ {"Name":"ravi","Age":25,"city":"mumbai"},
  {"Name":"rohan","Age":30,"city":"delhi"},
  {"Name":"Jack","Age":45,"city":"chennai"}
]
df = pd.DataFrame(data)
df

    Name  Age     city
0   ravi   25   mumbai
1  rohan   30    delhi
2   Jack   45  chennai

In [58]:
#row'th index
df.loc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [59]:
df.loc[0][0]

C:\Users\vijai Ganeshh\AppData\Local\Temp\ipykernel_1348\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

np.int64(10001)

In [60]:
df.iloc[0][2]

C:\Users\vijai Ganeshh\AppData\Local\Temp\ipykernel_1348\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Electronics'

In [66]:
df

    Name  Age     city
0   ravi   25   mumbai
1  rohan   30    delhi
2   Jack   45  chennai

In [67]:
df.at[1,'Age']

np.int64(30)

In [32]:
print(df.at[2,'Name'])

Jack

In [33]:
df.iat[2,2]

'Kashmir'

In [34]:
#Datamanipulation with dataframe
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30    Chicago
2   Jack   45    Kashmir

In [44]:
df['Salary'] = [50000,60000,90000]
df

    Name  Age       City  Salary
0  Krish   25  Bangalore   50000
1   John   30    Chicago   60000
2   Jack   45    Kashmir   90000

In [45]:
#Remove a column 
df.drop('Salary',axis = 1,inplace=True)
#by default axis = 0 checks in x axis by default
#inplace ="True" saves the changes made

In [46]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30    Chicago
2   Jack   45    Kashmir

In [52]:
df['Age'] = df['Age']+1
df

   Name  Age     City
1  John   32  Chicago
2  Jack   47  Kashmir

In [50]:
df.drop(0,inplace=True)

In [51]:
df

   Name  Age     City
1  John   31  Chicago
2  Jack   46  Kashmir

In [69]:
df.describe()

             Age
count   3.000000
mean   33.333333
std    10.408330
min    25.000000
25%    27.500000
50%    30.000000
75%    37.500000
max    45.000000